style-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-17 Fri 22:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Style Guide</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Style Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc15463a">1. Functions</a></li>
<li><a href="#org43fd0ce">2. Structs</a></li>
<li><a href="#org80cb5a1">3. Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc15463a" class="outline-2">
<h2 id="orgc15463a"><span class="section-number-2">1.</span> Functions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Functions should be formatted as such:</li>
</ul>

<pre class="example" id="org25cd943">
&lt;return type&gt;
&lt;name&gt;(&lt;params&gt;)
{
  body...
}
</pre>

<ul class="org-ul">
<li>All indents should be 2 spaces.</li>
<li>Macros should be in CAPS. The only exception is for when you want to treat a macro as a function.</li>
<li>Always put a comment after <code>#endif</code> with what it is ending.</li>
<li><b>Do not have 1 line <code>if</code> statements.</b></li>
<li>All functions should have the corrosponding data structure it is working with before the name.
For example, if I am making a <code>append</code> function for a <code>vector</code>, the name should be along the lines
of <code>vector_append</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-org43fd0ce" class="outline-2">
<h2 id="org43fd0ce"><span class="section-number-2">2.</span> Structs</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="org914a48e">
struct &lt;name&gt; {
  ...
}
</pre>

<ul class="org-ul">
<li>All structs must start with <code>struct</code> and then (lowercase) <code>&lt;name&gt;</code>.</li>
<li>Typedefs for struct names are not allowed as of now.</li>
</ul>

<pre class="example" id="org1c67c27">
struct my_vector {
  ...
}
</pre>
</div>
</div>

<div id="outline-container-org80cb5a1" class="outline-2">
<h2 id="org80cb5a1"><span class="section-number-2">3.</span> Misc</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>All <code>if</code>, <code>for</code>, <code>while</code> etc. should have brackets (the left bracket should be on the same line as the statement).</li>
<li><code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, etc. does not need whitespace, but == should.</li>
<li>Lines have a soft limit of 85 characters.</li>
<li><code>typedef</code>'d types should have <code>_t</code> appended to it.
Example:</li>
</ul>

<pre class="example" id="orgc7be3d6">
typedef int my_type_t;
</pre>

<ul class="org-ul">
<li>All variable, function, struct, and macro names should be snake<sub>case</sub>.</li>
<li>All file names have a hyphen ('-') to separate words.</li>
<li><b>Remove unnecessary trailing whitespace</b>.</li>
<li><b>Disable auto-formatters</b>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-05-17 Fri 22:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
